# Student Score dataset
## Objectives:
    1. Carry out descriptive analytics on the dataset.
    2. Check whether female and male students scored the same marks.
    3. Whether test preparation helps the students?

In [61]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats

In [62]:
data = pd.read_csv('Week_8_Q&A_dataset - Sheet1.csv')
data.head()

   Gender Test preparation  Total Marks
0    male             none           14
1  female             none           28
2  female             none           18
3  female             none           48
4  female             none           21

### 1. Carry out descriptive analytics on the dataset.

In [63]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Gender            28 non-null     object
 1   Test preparation  28 non-null     object
 2   Total Marks       28 non-null     int64
dtypes: int64(1), object(2)
memory usage: 800.0+ bytes

In [64]:
data.describe()

       Total Marks
count    28.000000
mean     32.321429
std      12.454520
min      12.000000
25%      22.500000
50%      33.000000
75%      43.250000
max      50.000000

### 2. Check whether female and male students scored the same marks.

In [65]:
data_male = data.loc[data['Gender'] == 'male']
data_male.describe()

       Total Marks
count    12.000000
mean     30.416667
std      12.168950
min      14.000000
25%      21.750000
50%      29.000000
75%      43.250000
max      47.000000

In [68]:
data_female = data.loc[data['Gender'] == 'female']
data_female.describe()

       Total Marks
count    16.000000
mean     33.750000
std      12.865976
min      12.000000
25%      25.500000
50%      39.000000
75%      43.500000
max      50.000000

In [71]:
#2 Tailed T Test
t_value, p_value = stats.ttest_ind(data_female['Total Marks'], data_male['Total Marks'], alternative='two-sided')
print("t_value:", t_value)
print("p_value:",p_value)

t_value: 0.6940885268848668
p_value: 0.4937822317960763

#### Summary:
    P value is higher than 0.05 (alpha)
    The Average marks obtained by male and female students are the same

### 3. Whether test preparation helps the students?

In [72]:
test_completed = data.loc[data['Test preparation'] == 'completed']
test_completed.describe()

       Total Marks
count     7.000000
mean     44.571429
std       3.359422
min      40.000000
25%      43.000000
50%      44.000000
75%      46.000000
max      50.000000

In [73]:
test_none = data.loc[data['Test preparation'] == 'none']
test_none.describe()

       Total Marks
count    21.000000
mean     28.238095
std      11.661495
min      12.000000
25%      18.000000
50%      27.000000
75%      38.000000
max      48.000000

In [74]:
t_value, p_value = stats.ttest_ind(test_completed['Total Marks'], test_none['Total Marks'], alternative='greater')
print("t_value:", t_value)
print("p_value: ", p_value)

t_value: 3.6143637527769217
p_value:  0.0006335646228660053

#### Summary:
    P_Value is lower than 0.05 (alpha)
    Reject the null hypothesis of equality of the two means for the alternative hypothesis.
    The students who completed the course have higher average score
    So we can conclude that test preperation helped the students.